serverless-trainticket-mongo/load_injection_scripts/ab/test1000-db-nodb.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid-no-db.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        145 bytes

Concurrency Level:      1
Time taken for tests:   12.862 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      377000 bytes
HTML transferred:       145000 bytes
Requests per second:    77.75 [#/sec] (mean)
Time per request:       12.862 [ms] (mean)
Time per request:       12.862 [ms] (mean, across all concurrent requests)
Transfer rate:          28.62 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   4.5      0     102
Processing:     7   12  12.6      8      91
Waiting:        7   12  12.7      8      91
Total:          7   13  13.4      8     112

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%     10
  80%     10
  90%     13
  95%     51
  98%     53
  99%     54
 100%    112 (longest request)