serverless-trainticket-mongo/load_injection_scripts/ab/test2000-db-nodb.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid-no-db.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        145 bytes

Concurrency Level:      1
Time taken for tests:   24.992 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      754000 bytes
HTML transferred:       290000 bytes
Requests per second:    80.03 [#/sec] (mean)
Time per request:       12.496 [ms] (mean)
Time per request:       12.496 [ms] (mean, across all concurrent requests)
Transfer rate:          29.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   3.2      0     102
Processing:     6   12  12.3      8     126
Waiting:        6   12  12.3      8     126
Total:          6   12  12.7      8     126

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%      9
  80%     10
  90%     13
  95%     51
  98%     52
  99%     53
 100%    126 (longest request)