serverless-trainticket-mongo/load_injection_scripts/ab/test2000-db.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        241 bytes

Concurrency Level:      1
Time taken for tests:   36.540 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      946000 bytes
HTML transferred:       482000 bytes
Requests per second:    54.73 [#/sec] (mean)
Time per request:       18.270 [ms] (mean)
Time per request:       18.270 [ms] (mean, across all concurrent requests)
Transfer rate:          25.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.3      0     102
Processing:     8   18  16.5     10      69
Waiting:        8   17  16.5      9      69
Total:          8   18  16.6     11     118

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     12
  80%     14
  90%     52
  95%     53
  98%     54
  99%     55
 100%    118 (longest request)