serverless-trainticket-mongo/load_injection_scripts/ab/test300-db-nodb.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid-no-db.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        145 bytes

Concurrency Level:      1
Time taken for tests:   3.614 seconds
Complete requests:      300
Failed requests:        0
Total transferred:      113100 bytes
HTML transferred:       43500 bytes
Requests per second:    83.00 [#/sec] (mean)
Time per request:       12.048 [ms] (mean)
Time per request:       12.048 [ms] (mean, across all concurrent requests)
Transfer rate:          30.56 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   5.9      0     102
Processing:     6   11  11.1      8      53
Waiting:        6   11  11.2      8      53
Total:          7   12  12.5      8     112

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%      9
  80%     10
  90%     12
  95%     50
  98%     52
  99%     53
 100%    112 (longest request)