serverless-trainticket-mongo/load_injection_scripts/ab/test300-db.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        241 bytes

Concurrency Level:      1
Time taken for tests:   5.172 seconds
Complete requests:      300
Failed requests:        0
Total transferred:      141900 bytes
HTML transferred:       72300 bytes
Requests per second:    58.00 [#/sec] (mean)
Time per request:       17.241 [ms] (mean)
Time per request:       17.241 [ms] (mean, across all concurrent requests)
Transfer rate:          26.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     8   17  16.3      9      70
Waiting:        8   17  16.4      9      69
Total:          8   17  16.3     10      70

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     10
  75%     11
  80%     13
  90%     51
  95%     53
  98%     54
  99%     55
 100%     70 (longest request)