serverless-trainticket-mongo/load_injection_scripts/ab/test400-db.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        241 bytes

Concurrency Level:      1
Time taken for tests:   7.152 seconds
Complete requests:      400
Failed requests:        0
Total transferred:      189200 bytes
HTML transferred:       96400 bytes
Requests per second:    55.93 [#/sec] (mean)
Time per request:       17.879 [ms] (mean)
Time per request:       17.879 [ms] (mean, across all concurrent requests)
Transfer rate:          25.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   5.0      0     101
Processing:     8   17  16.4      9      64
Waiting:        8   17  16.4      9      64
Total:          8   18  17.0     10     110

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     12
  80%     17
  90%     51
  95%     52
  98%     53
  99%     55
 100%    110 (longest request)