serverless-trainticket-mongo/load_injection_scripts/ab/test500-db-nodb.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid-no-db.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        145 bytes

Concurrency Level:      1
Time taken for tests:   6.338 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      188500 bytes
HTML transferred:       72500 bytes
Requests per second:    78.89 [#/sec] (mean)
Time per request:       12.675 [ms] (mean)
Time per request:       12.675 [ms] (mean, across all concurrent requests)
Transfer rate:          29.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       6
Processing:     6   12   9.7     10      64
Waiting:        6   12   9.8      9      64
Total:          6   13   9.7     10      64

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     11
  80%     12
  90%     14
  95%     48
  98%     53
  99%     56
 100%     64 (longest request)