serverless-trainticket-mongo/load_injection_scripts/ab/test500-db.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.49.2 (be patient)


Server Software:        
Server Hostname:        192.168.49.2
Server Port:            31112

Document Path:          /function/get-user-by-userid.openfaas-fn/accountId/4d2a46c7-71cb-4cf1-b5bb-b68406d9da6f
Document Length:        241 bytes

Concurrency Level:      1
Time taken for tests:   9.174 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      236500 bytes
HTML transferred:       120500 bytes
Requests per second:    54.50 [#/sec] (mean)
Time per request:       18.348 [ms] (mean)
Time per request:       18.348 [ms] (mean, across all concurrent requests)
Transfer rate:          25.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     8   18  17.0     10      66
Waiting:        8   18  17.1      9      66
Total:          8   18  17.0     10      67

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     12
  80%     50
  90%     52
  95%     52
  98%     55
  99%     56
 100%     67 (longest request)